# Organizando DataFrames (Sort)

In [1]:
import pandas as pd

In [2]:
data = [[1,2,3],[4,5,6],[7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
# podemos usar listas para criar o index e as colunas dos nossos DataFrames
list('123')

['1', '2', '3']

In [13]:
df = pd.DataFrame(data, list('321'), list('CBA'))
df

   C  B  A
3  1  2  3
2  4  5  6
1  7  8  9

In [15]:
# podemos usar a função sort index para organizar o index
df.sort_index()

   C  B  A
1  7  8  9
2  4  5  6
3  1  2  3

In [16]:
df.sort_index(axis=1)

   A  B  C
1  9  8  7
2  6  5  4
3  3  2  1

In [20]:
df.sort_index(inplace=True, axis=1)

In [21]:
df

   A  B  C
1  9  8  7
2  6  5  4
3  3  2  1

In [24]:
# também podemos organizar os valores do DataFrame
df.sort_values(by = "A", inplace=True)
df

   A  B  C
3  3  2  1
2  6  5  4
1  9  8  7

In [25]:
df.sort_values(by = "3", axis=1, inplace=True)
df

   C  B  A
3  1  2  3
2  4  5  6
1  7  8  9